Project#1-SOAP.postman_collection.json

{
	"info": {
		"_postman_id": "2bd97200-5981-43c5-a829-4ce6e4cdb45e",
		"name": "Project#1|SOAP",
		"schema": "https://schema.getpostman.com/json/collection/v2.0.0/collection.json",
		"_exporter_id": "28398995"
	},
	"item": [
		{
			"name": "TC1 - Number to Words - Positive",
			"protocolProfileBehavior": {
				"followOriginalHttpMethod": true
			},
			"request": {
				"method": "POST",
				"header": [
					{
						"key": "Content-Type",
						"value": "text/xml; charset=utf-8",
						"type": "text"
					}
				],
				"body": {
					"mode": "raw",
					"raw": "<?xml version=\"1.0\" encoding=\"utf-8\"?>\r\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n  <soap:Body>\r\n    <NumberToWords xmlns=\"http://www.dataaccess.com/webservicesserver/\">\r\n      <ubiNum>500</ubiNum>\r\n    </NumberToWords>\r\n  </soap:Body>\r\n</soap:Envelope> ",
					"options": {
						"raw": {
							"language": "xml"
						}
					}
				},
				"url": "http://www.dataaccess.com/webservicesserver/NumberConversion.wso"
			},
			"response": []
		},
		{
			"name": "TC2 - Number to Words - Negative",
			"protocolProfileBehavior": {
				"followOriginalHttpMethod": true
			},
			"request": {
				"method": "POST",
				"header": [
					{
						"key": "Content-Type",
						"value": "text/xml; charset=utf-8",
						"type": "text"
					}
				],
				"body": {
					"mode": "raw",
					"raw": "<?xml version=\"1.0\" encoding=\"utf-8\"?>\r\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n  <soap:Body>\r\n    <NumberToWords xmlns=\"http://www.dataaccess.com/webservicesserver/\">\r\n      <ubiNum>-1</ubiNum>\r\n    </NumberToWords>\r\n  </soap:Body>\r\n</soap:Envelope> ",
					"options": {
						"raw": {
							"language": "xml"
						}
					}
				},
				"url": "http://www.dataaccess.com/webservicesserver/NumberConversion.wso"
			},
			"response": []
		},
		{
			"name": "TC3 - Number to Words - Negative",
			"protocolProfileBehavior": {
				"followOriginalHttpMethod": true
			},
			"request": {
				"method": "POST",
				"header": [
					{
						"key": "Content-Type",
						"value": "text/xml; charset=utf-8",
						"type": "text"
					}
				],
				"body": {
					"mode": "raw",
					"raw": "<?xml version=\"1.0\" encoding=\"utf-8\"?>\r\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n  <soap:Body>\r\n    <NumberToWords xmlns=\"http://www.dataaccess.com/webservicesserver/\">\r\n      <ubiNum>abc</ubiNum>\r\n    </NumberToWords>\r\n  </soap:Body>\r\n</soap:Envelope> ",
					"options": {
						"raw": {
							"language": "xml"
						}
					}
				},
				"url": "http://www.dataaccess.com/webservicesserver/NumberConversion.wso"
			},
			"response": []
		},
		{
			"name": "TC4 - Number to Words - No Body",
			"protocolProfileBehavior": {
				"followOriginalHttpMethod": true
			},
			"request": {
				"method": "POST",
				"header": [
					{
						"key": "Content-Type",
						"value": "text/xml; charset=utf-8",
						"type": "text"
					}
				],
				"body": {
					"mode": "raw",
					"raw": "<?xml version=\"1.0\" encoding=\"utf-8\"?>\r\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n  <soap:Body>\r\n    <NumberToWords xmlns=\"http://www.dataaccess.com/webservicesserver/\">\r\n      <ubiNum></ubiNum>\r\n    </NumberToWords>\r\n  </soap:Body>\r\n</soap:Envelope> ",
					"options": {
						"raw": {
							"language": "xml"
						}
					}
				},
				"url": "http://www.dataaccess.com/webservicesserver/NumberConversion.wso"
			},
			"response": []
		},
		{
			"name": "TC5 - Number to Words -Negetive_Text",
			"protocolProfileBehavior": {
				"followOriginalHttpMethod": true
			},
			"request": {
				"method": "POST",
				"header": [
					{
						"key": "Content-Type",
						"value": "text/xml; charset=utf-8",
						"type": "text"
					}
				],
				"body": {
					"mode": "raw",
					"raw": "<?xml version=\"1.0\" encoding=\"utf-8\"?>\r\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n  <soap:Body>\r\n    <NumberToWords xmlns=\"http://www.dataaccess.com/webservicesserver/\">\r\n      <ubiNum>abc</ubiNum>\r\n    </NumberToWords>\r\n  </soap:Body>\r\n</soap:Envelope> ",
					"options": {
						"raw": {
							"language": "text"
						}
					}
				},
				"url": "http://www.dataaccess.com/webservicesserver/NumberConversion.wso"
			},
			"response": []
		},
		{
			"name": "TC6 - Number to Words -Removing Headder",
			"protocolProfileBehavior": {
				"disableBodyPruning": true,
				"followOriginalHttpMethod": true
			},
			"request": {
				"method": "GET",
				"header": [
					{
						"key": "Content-Type",
						"value": "text/xml; charset=utf-8",
						"type": "text"
					}
				],
				"body": {
					"mode": "raw",
					"raw": "<?xml version=\"1.0\" encoding=\"utf-8\"?>\r\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n  <soap:Body>\r\n    <NumberToWords xmlns=\"http://www.dataaccess.com/webservicesserver/\">\r\n      <ubiNum>500</ubiNum>\r\n    </NumberToWords>\r\n  </soap:Body>\r\n</soap:Envelope> ",
					"options": {
						"raw": {
							"language": "xml"
						}
					}
				},
				"url": "http://www.dataaccess.com/webservicesserver/NumberConversion.wso"
			},
			"response": []
		},
		{
			"name": "TC7 - Number to Words -Change the method",
			"protocolProfileBehavior": {
				"disableBodyPruning": true,
				"followOriginalHttpMethod": true
			},
			"request": {
				"method": "GET",
				"header": [
					{
						"key": "Content-Type",
						"value": "text/xml; charset=utf-8",
						"type": "text"
					}
				],
				"body": {
					"mode": "raw",
					"raw": "<?xml version=\"1.0\" encoding=\"utf-8\"?>\r\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n  <soap:Body>\r\n    <NumberToWords xmlns=\"http://www.dataaccess.com/webservicesserver/\">\r\n      <ubiNum>500</ubiNum>\r\n    </NumberToWords>\r\n  </soap:Body>\r\n</soap:Envelope> ",
					"options": {
						"raw": {
							"language": "xml"
						}
					}
				},
				"url": "http://www.dataaccess.com/webservicesserver/NumberConversion.wso"
			},
			"response": []
		},
		{
			"name": "TC8 - Number to Words -API Response Status",
			"protocolProfileBehavior": {
				"followOriginalHttpMethod": true
			},
			"request": {
				"method": "POST",
				"header": [
					{
						"key": "Content-Type",
						"value": "text/xml; charset=utf-8",
						"type": "text"
					}
				],
				"body": {
					"mode": "raw",
					"raw": "<?xml version=\"1.0\" encoding=\"utf-8\"?>\r\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n  <soap:Body>\r\n    <NumberToWords xmlns=\"http://www.dataaccess.com/webservicesserver/\">\r\n      <ubiNum>500</ubiNum>\r\n    </NumberToWords>\r\n  </soap:Body>\r\n</soap:Envelope> ",
					"options": {
						"raw": {
							"language": "xml"
						}
					}
				},
				"url": "http://www.dataaccess.com/webservicesserver/NumberConversion.wso"
			},
			"response": []
		},
		{
			"name": "TC10 - Number to Words - single-digit number conversion",
			"protocolProfileBehavior": {
				"followOriginalHttpMethod": true
			},
			"request": {
				"method": "POST",
				"header": [
					{
						"key": "Content-Type",
						"value": "text/xml; charset=utf-8",
						"type": "text"
					}
				],
				"body": {
					"mode": "raw",
					"raw": "<?xml version=\"1.0\" encoding=\"utf-8\"?>\r\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n  <soap:Body>\r\n    <NumberToWords xmlns=\"http://www.dataaccess.com/webservicesserver/\">\r\n      <ubiNum>7</ubiNum>\r\n    </NumberToWords>\r\n  </soap:Body>\r\n</soap:Envelope> ",
					"options": {
						"raw": {
							"language": "xml"
						}
					}
				},
				"url": "http://www.dataaccess.com/webservicesserver/NumberConversion.wso"
			},
			"response": []
		},
		{
			"name": "TC11 - Number to Words - double-digit number conversion",
			"protocolProfileBehavior": {
				"followOriginalHttpMethod": true
			},
			"request": {
				"method": "POST",
				"header": [
					{
						"key": "Content-Type",
						"value": "text/xml; charset=utf-8",
						"type": "text"
					}
				],
				"body": {
					"mode": "raw",
					"raw": "<?xml version=\"1.0\" encoding=\"utf-8\"?>\r\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n  <soap:Body>\r\n    <NumberToWords xmlns=\"http://www.dataaccess.com/webservicesserver/\">\r\n      <ubiNum>7</ubiNum>\r\n    </NumberToWords>\r\n  </soap:Body>\r\n</soap:Envelope> ",
					"options": {
						"raw": {
							"language": "xml"
						}
					}
				},
				"url": "http://www.dataaccess.com/webservicesserver/NumberConversion.wso"
			},
			"response": []
		},
		{
			"name": "TC12 - Number to Words - four-digit number conversion",
			"protocolProfileBehavior": {
				"followOriginalHttpMethod": true
			},
			"request": {
				"method": "POST",
				"header": [
					{
						"key": "Content-Type",
						"value": "text/xml; charset=utf-8",
						"type": "text"
					}
				],
				"body": {
					"mode": "raw",
					"raw": "<?xml version=\"1.0\" encoding=\"utf-8\"?>\r\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n  <soap:Body>\r\n    <NumberToWords xmlns=\"http://www.dataaccess.com/webservicesserver/\">\r\n      <ubiNum>7</ubiNum>\r\n    </NumberToWords>\r\n  </soap:Body>\r\n</soap:Envelope> ",
					"options": {
						"raw": {
							"language": "xml"
						}
					}
				},
				"url": "http://www.dataaccess.com/webservicesserver/NumberConversion.wso"
			},
			"response": []
		},
		{
			"name": "TC13 - Number to Words - zero conversion",
			"protocolProfileBehavior": {
				"followOriginalHttpMethod": true
			},
			"request": {
				"method": "POST",
				"header": [
					{
						"key": "Content-Type",
						"value": "text/xml; charset=utf-8",
						"type": "text"
					}
				],
				"body": {
					"mode": "raw",
					"raw": "<?xml version=\"1.0\" encoding=\"utf-8\"?>\r\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n  <soap:Body>\r\n    <NumberToWords xmlns=\"http://www.dataaccess.com/webservicesserver/\">\r\n      <ubiNum>7</ubiNum>\r\n    </NumberToWords>\r\n  </soap:Body>\r\n</soap:Envelope> ",
					"options": {
						"raw": {
							"language": "xml"
						}
					}
				},
				"url": "http://www.dataaccess.com/webservicesserver/NumberConversion.wso"
			},
			"response": []
		},
		{
			"name": "TC14 - Number to Words - maximum boundary value",
			"protocolProfileBehavior": {
				"followOriginalHttpMethod": true
			},
			"request": {
				"method": "POST",
				"header": [
					{
						"key": "Content-Type",
						"value": "text/xml; charset=utf-8",
						"type": "text"
					}
				],
				"body": {
					"mode": "raw",
					"raw": "<?xml version=\"1.0\" encoding=\"utf-8\"?>\r\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n  <soap:Body>\r\n    <NumberToWords xmlns=\"http://www.dataaccess.com/webservicesserver/\">\r\n      <ubiNum>7</ubiNum>\r\n    </NumberToWords>\r\n  </soap:Body>\r\n</soap:Envelope> ",
					"options": {
						"raw": {
							"language": "xml"
						}
					}
				},
				"url": "http://www.dataaccess.com/webservicesserver/NumberConversion.wso"
			},
			"response": []
		},
		{
			"name": "TC15 - Number to Words - negative number input",
			"protocolProfileBehavior": {
				"followOriginalHttpMethod": true
			},
			"request": {
				"method": "POST",
				"header": [
					{
						"key": "Content-Type",
						"value": "text/xml; charset=utf-8",
						"type": "text"
					}
				],
				"body": {
					"mode": "raw",
					"raw": "<?xml version=\"1.0\" encoding=\"utf-8\"?>\r\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n  <soap:Body>\r\n    <NumberToWords xmlns=\"http://www.dataaccess.com/webservicesserver/\">\r\n      <ubiNum>7</ubiNum>\r\n    </NumberToWords>\r\n  </soap:Body>\r\n</soap:Envelope> ",
					"options": {
						"raw": {
							"language": "xml"
						}
					}
				},
				"url": "http://www.dataaccess.com/webservicesserver/NumberConversion.wso"
			},
			"response": []
		},
		{
			"name": "TC16 - Number to Words - missing <ubiNum> tag",
			"protocolProfileBehavior": {
				"followOriginalHttpMethod": true
			},
			"request": {
				"method": "POST",
				"header": [
					{
						"key": "Content-Type",
						"value": "text/xml; charset=utf-8",
						"type": "text"
					}
				],
				"body": {
					"mode": "raw",
					"raw": "<?xml version=\"1.0\" encoding=\"utf-8\"?>\r\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n  <soap:Body>\r\n    <NumberToWords xmlns=\"http://www.dataaccess.com/webservicesserver/\">\r\n      <ubiNum>7</ubiNum>\r\n    </NumberToWords>\r\n  </soap:Body>\r\n</soap:Envelope> ",
					"options": {
						"raw": {
							"language": "xml"
						}
					}
				},
				"url": "http://www.dataaccess.com/webservicesserver/NumberConversion.wso"
			},
			"response": []
		},
		{
			"name": "TC17 - Number to Words - large number beyond supported range",
			"protocolProfileBehavior": {
				"followOriginalHttpMethod": true
			},
			"request": {
				"method": "POST",
				"header": [
					{
						"key": "Content-Type",
						"value": "text/xml; charset=utf-8",
						"type": "text"
					}
				],
				"body": {
					"mode": "raw",
					"raw": "<?xml version=\"1.0\" encoding=\"utf-8\"?>\r\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n  <soap:Body>\r\n    <NumberToWords xmlns=\"http://www.dataaccess.com/webservicesserver/\">\r\n      <ubiNum>7</ubiNum>\r\n    </NumberToWords>\r\n  </soap:Body>\r\n</soap:Envelope> ",
					"options": {
						"raw": {
							"language": "xml"
						}
					}
				},
				"url": "http://www.dataaccess.com/webservicesserver/NumberConversion.wso"
			},
			"response": []
		},
		{
			"name": "TC18 - Number to Words - input with special characters",
			"protocolProfileBehavior": {
				"followOriginalHttpMethod": true
			},
			"request": {
				"method": "POST",
				"header": [
					{
						"key": "Content-Type",
						"value": "text/xml; charset=utf-8",
						"type": "text"
					}
				],
				"body": {
					"mode": "raw",
					"raw": "<?xml version=\"1.0\" encoding=\"utf-8\"?>\r\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n  <soap:Body>\r\n    <NumberToWords xmlns=\"http://www.dataaccess.com/webservicesserver/\">\r\n      <ubiNum>7</ubiNum>\r\n    </NumberToWords>\r\n  </soap:Body>\r\n</soap:Envelope> ",
					"options": {
						"raw": {
							"language": "xml"
						}
					}
				},
				"url": "http://www.dataaccess.com/webservicesserver/NumberConversion.wso"
			},
			"response": []
		},
		{
			"name": "TC19 - Number to Words - response time for a valid request -within 1 second",
			"protocolProfileBehavior": {
				"followOriginalHttpMethod": true
			},
			"request": {
				"method": "POST",
				"header": [
					{
						"key": "Content-Type",
						"value": "text/xml; charset=utf-8",
						"type": "text"
					}
				],
				"body": {
					"mode": "raw",
					"raw": "<?xml version=\"1.0\" encoding=\"utf-8\"?>\r\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n  <soap:Body>\r\n    <NumberToWords xmlns=\"http://www.dataaccess.com/webservicesserver/\">\r\n      <ubiNum>7</ubiNum>\r\n    </NumberToWords>\r\n  </soap:Body>\r\n</soap:Envelope> ",
					"options": {
						"raw": {
							"language": "xml"
						}
					}
				},
				"url": "http://www.dataaccess.com/webservicesserver/NumberConversion.wso"
			},
			"response": []
		},
		{
			"name": "TC20 - Number to Words - Response for malformed XML request",
			"protocolProfileBehavior": {
				"followOriginalHttpMethod": true
			},
			"request": {
				"method": "POST",
				"header": [
					{
						"key": "Content-Type",
						"value": "text/xml; charset=utf-8",
						"type": "text"
					}
				],
				"body": {
					"mode": "raw",
					"raw": "<?xml version=\"1.0\" encoding=\"utf-8\"?>\r\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n  <soap:Body>\r\n    <NumberToWords xmlns=\"http://www.dataaccess.com/webservicesserver/\">\r\n      <ubiNum>7</ubiNum>\r\n    </NumberToWords>\r\n  </soap:Body>\r\n</soap:Envelope> ",
					"options": {
						"raw": {
							"language": "xml"
						}
					}
				},
				"url": "http://www.dataaccess.com/webservicesserver/NumberConversion.wso"
			},
			"response": []
		}
	]
}